__author__ = 'uesr'

city_map = {
    "广东":{
        "广州":["天河区","白云区","荔湾区","越秀区"],
        "佛山":["南海区","桂城区","顺德区","禅城区"],
        "深圳":["南山区","罗湖区","宝安区","龙岗区"]
    },
    "广西":{
        "南宁":["青秀区","兴宁区","江南区","良庆区"],
        "柳州":["柳南区","鱼峰区","城中区","柳北区"],
        "桂林":["叠彩区","象山区","秀峰区","雁山区"]
    },
    "云南":{
        "昆明":["五华区","盘龙区","官渡区","西山区"],
        "丽江":["古城区","永胜县","玉龙县","华坪县"],
        "大理":["祥云县","宾川县","弥渡县","永平县"],
        "保山":["隆阳区","施甸县","腾冲县","龙陵县"]
    },

}



for i in range(3):  #外循环，指定循环3次，3次外循环完了，就退出程序
    city_name = input("请输入你要查看的省市名字:")
    if city_name in city_map:  #检查输入的省是否在地图中，如果省名字3次输入错误，走到60行，程序退出
        sheng_name = city_map[city_name]  #使用输入的信息作为key，取出省信息，存在字典中
        shi_name =sheng_name.keys()  #取出省中有哪些地市，存在列表中
        while True:  #内循环，死循环，不指定循环次数，通过break或者flag跳出
            print ("----包含的市是----")    #友好的提示，分隔线
            for i in shi_name:  #遍历列表，取出地市名字，打印出来
                print (i)
            print ("------------------")  #友好的提示，分隔线
            shi_name_input = input("请输入你要查看的地市名字:")
            if shi_name_input in shi_name: #判断输入的地市名字是否在地市列表中
                quxian_name = city_map[city_name][shi_name_input]  #取出地市中有哪些区县，存在列表中
                print ("----包含的区县是----")  #友好的提示，分隔线
                for i in quxian_name: #遍历列表，取出区县名字，打印出来
                    print (i)
                print ("-------------------")  #